Revit 2026 API

# View3DIsPerspective Property

---

Identifies whether this is a perspective view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsPerspective { get; }
```
```vb
Public ReadOnly Property IsPerspective As Boolean
	Get
```
```cpp
public:
property bool IsPerspective {
	bool get ();
}
```
```fsharp
member IsPerspective : bool with get
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Returns true if the view is not a view template. |

In a perspective view, view direction is variable - it is the direction that connects a particular point on the model with the eye position. The property ViewDirection becomes less meaningful - it only describes the general orientation of the camera.

#### Reference

View3D Class

Autodesk.Revit.DB Namespace